Revit 2027 API
Curve.Reference Property
Returns a stable reference to the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference Reference { get; }
Public ReadOnly Property Reference As Reference
	Get
public:
property Reference^ Reference {
	Reference^ get ();
}
member Reference : Reference with get
Property Value
Reference
This value is set for curve geometry obtained from Revit elements. null if the curve was created via parameters, copying, transform, or other operations.
Remarks
This value is also if the corresponding geometry object does not permit referencing.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace